z-mnp-test/misc/MIW_OM_1010.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:ws="http://ws.clearinghouse.com">
   <soap:Header/>
   <soap:Body>
      <ws:processNPCMsg>
         <ws:userId>mnpCatTest</ws:userId>
         <ws:password>bW5wQ2xoVGVzdDIwMTE=</ws:password>
         <ws:xmlMsg><![CDATA[<?xml version="1.0" encoding="UTF-8" standalone="yes"?><NPCMessageData>
    <NPCData>
        <MessageHeader>
            <PortType>1</PortType>
            <MessageID>1010</MessageID>
            <SoapRequestId>104</SoapRequestId>			
            <MessageCreateTimeStamp>20160928104000</MessageCreateTimeStamp>
            <Sender>CRDB</Sender>
		  <Receiver>CATCDMA</Receiver>
        </MessageHeader>
        <NPCMessages>
            <PortBroadcast>
                <Donor>AIS</Donor>
                <Recipient>CATCDMA</Recipient>
                <NumberHolderInd>00</NumberHolderInd>
                <MSISDN>0818437369</MSISDN>
                <PortId>20171011CATCDMA0000002</PortId>
                <Route>0680210879300001</Route>
            </PortBroadcast>
             <PortBroadcast>
                <Donor>AIS</Donor>
                <Recipient>DTN</Recipient>
                <NumberHolderInd>00</NumberHolderInd>
                <MSISDN>0879300002</MSISDN>
                <PortId>20160928DTNX0000001</PortId>
                <Route>0680210879300001</Route>
             </PortBroadcast>
        </NPCMessages>
        <MessageFooter>
            <Checksum>2</Checksum>
        </MessageFooter>
    </NPCData>
</NPCMessageData>]]></ws:xmlMsg>
      </ws:processNPCMsg>
   </soap:Body>
</soap:Envelope>